In [1]:
import numpy as np
import pandas as pd

In [3]:
a = np.array([[1,2,3,4],[5,6,7,8]])

In [26]:
dict1 = {
    "name": ["Chinmay","DoIT","NeverGiveUP","ican"],
    "marks": [99, 98, 100, 1000],
    "city": ["dpr", "aura", "eathOn","mars"]
    
}

In [27]:
df = pd.DataFrame(dict1)

In [28]:
df

          name  marks    city
0      Chinmay     99     dpr
1         DoIT     98    aura
2  NeverGiveUP    100  eathOn
3         ican   1000    mars

In [29]:
df.to_csv('friends.csv')

In [30]:
df.to_csv('friends_index_false.csv', index="false")

In [33]:
df.head(2)

      name  marks  city
0  Chinmay     99   dpr
1     DoIT     98  aura

In [34]:
df.tail(2)

          name  marks    city
2  NeverGiveUP    100  eathOn
3         ican   1000    mars

In [35]:
df.describe()

            marks
count     4.00000
mean    324.25000
std     450.50074
min      98.00000
25%      98.75000
50%      99.50000
75%     325.00000
max    1000.00000

In [45]:
 df.to_csv('chinmay.csv')

In [48]:
cb = pd.read_csv('chinmay.csv')

In [49]:
cb

   Unnamed: 0  train no  speed    city
0           0      3453     99     dpr
1           1      3453     98    aura
2           2      9458    100  eathOn
3           3      2444   1000    mars

In [ ]:
cb['speed'0